# Data Manipulation

In [1]:
import pandas as pd

In [20]:
data = {
    "Name": ["Amir", "Ali", "Ahmad", "Asghar"],
    "Age": [18, 19, 20, 19],
    "Course": ["BE", "MBBS", "MBBS", "BE"]
}
df = pd.DataFrame(data)
df

     Name  Age Course
0    Amir   18     BE
1     Ali   19   MBBS
2   Ahmad   20   MBBS
3  Asghar   19     BE

## Add new column

In [21]:
df["City"] = ["Tehran", "Tabriz", "Rasht", "Esfahan"]
df

     Name  Age Course     City
0    Amir   18     BE   Tehran
1     Ali   19   MBBS   Tabriz
2   Ahmad   20   MBBS    Rasht
3  Asghar   19     BE  Esfahan

In [22]:
df.insert(3, "Weight", [80, 74, 69, 90])
df

     Name  Age Course  Weight     City
0    Amir   18     BE      80   Tehran
1     Ali   19   MBBS      74   Tabriz
2   Ahmad   20   MBBS      69    Rasht
3  Asghar   19     BE      90  Esfahan

## Drop Row

In [23]:
new_df = df.drop([1], inplace=False)
new_df
# Drop row index = 1
# inplace = False ==> Action not effects df

     Name  Age Course  Weight     City
0    Amir   18     BE      80   Tehran
2   Ahmad   20   MBBS      69    Rasht
3  Asghar   19     BE      90  Esfahan

In [24]:
df.drop([1,3], inplace=True)
df
# Drop rows index = 1 and 3
# inplace = True ==> result on df

    Name  Age Course  Weight    City
0   Amir   18     BE      80  Tehran
2  Ahmad   20   MBBS      69   Rasht

## Drop Column

In [25]:
new_df = df.drop(['Age', 'City'], axis=1, inplace=False)
new_df

    Name Course  Weight
0   Amir     BE      80
2  Ahmad   MBBS      69